{
  "backend/main.mo": "Defines game metadata and high score storage using maps, provides queries for available games and scores, and handles score submission logic.",
  "backend/migration.mo": "Migrates old actor state to include new score maps for Frogger, Galaga, and Minesweeper.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files including game pages, routing, and shared components.",
  "frontend/index.css": "Defines base Tailwind layers and theme variables for light and dark modes with custom color tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router with routes for all game pages and leaderboard, wrapped in a theme provider.",
  "frontend/src/components/Layout.tsx": "Provides the main page layout with header navigation, footer, and outlet for routed content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor, updating it when the user’s identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and loading stored identities. Wraps AuthClient creation and exposes status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching games, high scores, player scores, and submitting new scores via the backend actor. Automatically handles caching and invalidation.",
  "frontend/src/index.css": "Sets up Tailwind layers and global design tokens, including color variables, dark mode overrides, and utility classes. Applies base typography and pixel-font styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider. Loads global styles and renders the root component.",
  "frontend/src/pages/AsteroidsGame.tsx": "Implements a playable Asteroids game with ship movement, bullets, asteroids, scoring, and life tracking. Supports pausing, resetting, and submitting scores.",
  "frontend/src/pages/BreakoutGame.tsx": "Implements a Breakout-style game with paddle control, ball physics, bricks, scoring, and lives. Includes pause/reset controls and score submission.",
  "frontend/src/pages/DonkeyKongGame.tsx": "Implements a Donkey Kong–inspired platformer with jumping, ladders, falling barrels, scoring, levels, and lives. Allows pausing, resetting, and submitting scores.",
  "frontend/src/pages/FroggerGame.tsx": "Implements a Frogger clone with canvas rendering, obstacle generation, collision handling, scoring, and a score‑submission dialog.",
  "frontend/src/pages/GalagaGame.tsx": "Implements a Galaga-style shooter with waves of aliens, player and alien bullets, movement logic, scoring, and game state management.",
  "frontend/src/pages/HomePage.tsx": "Displays a grid of available games with images and navigation links, using data from the backend.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows leaderboards for all games with tabs, score tables, and navigation, loading data from high-score queries.",
  "frontend/src/pages/MinesweeperGame.tsx": "Implements a Minesweeper game including grid generation, mine placement, reveal logic, timer, and score submission dialog.",
  "frontend/src/pages/PacManGame.tsx": "Implements a Pac‑Man clone with grid movement, ghost AI, scoring, lives, and score submission UI.",
  "frontend/src/pages/PongGame.tsx": "Implements a single‑player Pong game with paddle controls, AI opponent, ball physics, scoring, and score submission.",
  "frontend/src/pages/RollingBallsGame.tsx": "Implements a physics‑based rolling ball platformer with moving platforms, checkpoints, scoring, and pause/submit UI.",
  "frontend/src/pages/SnakeGame.tsx": "Implements a classic Snake game with grid movement, collision detection, food generation, scoring, and score submission.",
  "frontend/src/pages/SpaceInvadersGame.tsx": "Implements a Space Invaders clone with player movement, aliens, bullets, collision logic, scoring, and score submission.",
  "frontend/src/pages/TetrisGame.tsx": "Implements a full React-based Tetris game with rendering, piece logic, scoring, pause/game over handling, and score submission.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, features, requirements, and pending requests for adding classic games and backend support."
}