{
  "backend/main.mo": "Defines the actor storing per‑game score maps, comparison logic, and the list of all games including newly added ones.",
  "backend/migration.mo": "Migrates older actor state to a new structure by adding empty score maps for six additional games.",
  "feature_evidence.json": "Lists feature evidence for adding six new games, routing updates, and preview image integration with associated files and tests.",
  "frontend-file-summaries.txt": "Contains summarized descriptions of frontend files including routing, game pages, components, and styles.",
  "frontend/index.css": "Defines global Tailwind CSS variables and theming rules for light and dark modes.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router with routes for all games, home, and leaderboard using a shared layout.",
  "frontend/src/components/Layout.tsx": "Provides the global layout with header navigation, footer, and outlet for routed pages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using React Query, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity creation, login, logout, and status tracking via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching games, scores, player scores, and submitting scores using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables, themes, and utility classes including a pixel font style.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AsteroidsGame.tsx": "Implements an Asteroids-style canvas game with movement, shooting, collisions, and score submission.",
  "frontend/src/pages/BreakoutGame.tsx": "Implements a Breakout-style paddle and brick game with collision logic, scoring, and score submission.",
  "frontend/src/pages/BubbleShooterGame.tsx": "Implements a Bubble Shooter game with bubble grids, shooting mechanics, matching logic, and score submission.",
  "frontend/src/pages/CentipedeGame.tsx": "Canvas-based Centipede clone handling player movement, centipede segments, mushrooms, bullets, collisions, scoring, and pause/game-over logic.",
  "frontend/src/pages/DigDugGame.tsx": "Implements a Dig Dug–style game with tunneling, enemy spawning, movement, drawing, and score/life management.",
  "frontend/src/pages/DonkeyKongGame.tsx": "Donkey Kong platformer with player physics, ladders, platforms, barrel spawning, collision checks, and level progression.",
  "frontend/src/pages/FroggerGame.tsx": "Frogger grid game featuring vehicle and log generation, movement, collision checking, frog resets, and game-over handling.",
  "frontend/src/pages/GalagaGame.tsx": "Galaga shooter implementing player movement, bullets, alien waves, enemy fire, collision updates, and wave progression.",
  "frontend/src/pages/HomePage.tsx": "Displays a hero banner and a dynamic grid of selectable arcade games with loading placeholders and navigation support.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows a tabbed leaderboard for all games, fetching high scores and allowing game-specific score viewing with navigation back to home.",
  "frontend/src/pages/MinesweeperGame.tsx": "Implements a Minesweeper game using a grid with mines, timing, win/loss logic, canvas rendering, and score submission dialog.",
  "frontend/src/pages/MissileCommandGame.tsx": "Implements a Missile Command game with canvas rendering, missile waves, explosions, base destruction, scoring, and score submission.",
  "frontend/src/pages/PacManGame.tsx": "Implements a Pac‑Man game with maze logic, ghost movement, scoring, lives, power mode, and score submission using canvas rendering.",
  "frontend/src/pages/PinballGame.tsx": "Canvas-based pinball game with ball physics, bumpers, flippers, scoring, lives, and score submission dialog.",
  "frontend/src/pages/PongGame.tsx": "Single-player Pong with AI paddle movement, ball physics, scoring, pause/reset controls, and score submission.",
  "frontend/src/pages/QbertGame.tsx": "Q*bert-style isometric pyramid game with cube state changes, player movement, enemies, levels, lives, and scoring.",
  "frontend/src/pages/RollingBallsGame.tsx": "Platformer-style rolling ball game with gravity, moving platforms, checkpoints, scoring, and physics updates.",
  "frontend/src/pages/SnakeGame.tsx": "Grid-based Snake game with food spawning, collision detection, scoring, pause/reset, and score submission dialog.",
  "frontend/src/pages/SpaceInvadersGame.tsx": "Implements a full Space Invaders game in React using canvas, including player movement, alien waves, bullets, scoring, lives, pause/reset controls, and score submission dialog.",
  "frontend/src/pages/TetrisGame.tsx": "Implements a Tetris game in React with board state, tetromino logic, collisions, line clearing, leveling, pause/reset controls, and score submission dialog.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, themes, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Tracks project metadata, feature requirements, and planned additions including six new classic games and related frontend/backend updates."
}