{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add 6 additional classic games to Retro Arcade (frontend)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement six new playable game pages (Centipede, Missile Command, Pinball, Bubble Shooter, Q*bert, Dig Dug) following existing UI/UX patterns and score submission flow.",
      "acceptanceCriteria": [
        "There are 6 new routes (one per new game) that render a playable game (not a placeholder screen).",
        "Each new game page displays: Back to Games navigation, a visible score display, a How to Play section, and controls consistent with existing games (Start/Pause/Reset where applicable).",
        "Each new game triggers a game-over (or equivalent end-of-run) state and shows a score submission dialog that calls the existing score submission flow.",
        "User-facing text on the new pages is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CentipedeGame.tsx",
          "operation": "create",
          "description": "Create a dedicated playable Centipede React/TypeScript game page matching existing game page structure (Back button, main play area, SCORE card, HOW TO PLAY card, Start/Pause/Reset where applicable) and implement end-of-run state that opens a shadcn-ui Dialog for score submission using useSubmitScore(). Use shadcn-ui components (Card/Button/Dialog/Input/Label) to match existing UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/MissileCommandGame.tsx",
          "operation": "create",
          "description": "Create a dedicated playable Missile Command React/TypeScript game page matching existing game page structure and controls, with a game-over state that opens a shadcn-ui Dialog and submits score via useSubmitScore() using game name 'Missile Command'. Use shadcn-ui components to match existing UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PinballGame.tsx",
          "operation": "create",
          "description": "Create a dedicated playable Pinball React/TypeScript game page matching existing game page patterns (Back button, score panel, how-to-play panel, controls as applicable). Implement a run/end condition (e.g., balls/lives exhausted) that shows a shadcn-ui Dialog to submit the final score via useSubmitScore() using game name 'Pinball'. Use shadcn-ui components to match existing UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/BubbleShooterGame.tsx",
          "operation": "create",
          "description": "Create a dedicated playable Bubble Shooter React/TypeScript game page matching existing game page patterns and include Start/Pause/Reset where applicable. Implement end-of-run conditions (e.g., bubbles reach a limit or cleared) that triggers a shadcn-ui Dialog and submits score via useSubmitScore() using game name 'Bubble Shooter'. Use shadcn-ui components to match existing UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/QbertGame.tsx",
          "operation": "create",
          "description": "Create a dedicated playable Q*bert React/TypeScript game page matching existing UI/UX patterns, with visible scoring and controls, and an end-of-run state that opens a shadcn-ui Dialog to submit score via useSubmitScore() using game name 'Q*bert'. Use shadcn-ui components to match existing UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/DigDugGame.tsx",
          "operation": "create",
          "description": "Create a dedicated playable Dig Dug React/TypeScript game page matching existing UI/UX patterns, with visible scoring and controls, and a game-over/end-of-run state that opens a shadcn-ui Dialog to submit score via useSubmitScore() using game name 'Dig Dug'. Use shadcn-ui components to match existing UI. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Wire the six new games into routing and navigation (App routes, Home card mappings, Leaderboard Play button mapping).",
      "acceptanceCriteria": [
        "Home page shows 6 additional game cards returned by getAvailableGames(), and the Play Now button navigates to the correct new game route for each new game.",
        "/leaderboard loads tabs from backend getAvailableGames() (existing behavior) and the \"Play {game.name}\" button navigates correctly for each of the six new games.",
        "All new routes render without runtime errors (no undefined route/image lookups for the new game names)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add imports and TanStack Router routes for the 6 new game pages (Centipede, Missile Command, Pinball, Bubble Shooter, Q*bert, Dig Dug) and register them in the routeTree so navigation to each new game path renders without runtime errors."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Extend the Home page navigation mappings to include route slugs and preview image mappings for the six new game names returned by getAvailableGames() (Centipede, Missile Command, Pinball, Bubble Shooter, Q*bert, Dig Dug) so Play Now and card rendering do not hit undefined lookups. Use existing shadcn-ui Card/Button patterns already present. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LeaderboardPage.tsx",
          "operation": "modify",
          "description": "Extend the GAME_ROUTES mapping so the \"Play {game.name}\" button navigates correctly for the six new game names (Centipede, Missile Command, Pinball, Bubble Shooter, Q*bert, Dig Dug) loaded from getAvailableGames(). Use existing shadcn-ui Tabs/Table/Button patterns. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add and render static preview images for the six new games using the existing generated asset convention and Home page mapping.",
      "acceptanceCriteria": [
        "Six new preview image files exist under frontend/public/assets/generated with the exact filenames specified in imageRequirements.required.",
        "Home page cards for the six new games render these preview images (no broken image icons)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/centipede-preview.dim_300x200.png",
          "operation": "create",
          "description": "Add the generated static preview image asset for Centipede at frontend/public/assets/generated/centipede-preview.dim_300x200.png and ensure it is referenced by the existing Home page gameImages mapping."
        },
        {
          "path": "frontend/public/assets/generated/missile-command-preview.dim_300x200.png",
          "operation": "create",
          "description": "Add the generated static preview image asset for Missile Command at frontend/public/assets/generated/missile-command-preview.dim_300x200.png and ensure it is referenced by the existing Home page gameImages mapping."
        },
        {
          "path": "frontend/public/assets/generated/pinball-preview.dim_300x200.png",
          "operation": "create",
          "description": "Add the generated static preview image asset for Pinball at frontend/public/assets/generated/pinball-preview.dim_300x200.png and ensure it is referenced by the existing Home page gameImages mapping."
        },
        {
          "path": "frontend/public/assets/generated/bubble-shooter-preview.dim_300x200.png",
          "operation": "create",
          "description": "Add the generated static preview image asset for Bubble Shooter at frontend/public/assets/generated/bubble-shooter-preview.dim_300x200.png and ensure it is referenced by the existing Home page gameImages mapping."
        },
        {
          "path": "frontend/public/assets/generated/qbert-preview.dim_300x200.png",
          "operation": "create",
          "description": "Add the generated static preview image asset for Q*bert at frontend/public/assets/generated/qbert-preview.dim_300x200.png and ensure it is referenced by the existing Home page gameImages mapping."
        },
        {
          "path": "frontend/public/assets/generated/dig-dug-preview.dim_300x200.png",
          "operation": "create",
          "description": "Add the generated static preview image asset for Dig Dug at frontend/public/assets/generated/dig-dug-preview.dim_300x200.png and ensure it is referenced by the existing Home page gameImages mapping."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Ensure the gameImages mapping includes exact references for the six new generated image files (frontend/public/assets/generated/centipede-preview.dim_300x200.png, frontend/public/assets/generated/missile-command-preview.dim_300x200.png, frontend/public/assets/generated/pinball-preview.dim_300x200.png, frontend/public/assets/generated/bubble-shooter-preview.dim_300x200.png, frontend/public/assets/generated/qbert-preview.dim_300x200.png, frontend/public/assets/generated/dig-dug-preview.dim_300x200.png) so Home game cards render without broken images. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}